app/controllers/heroesnvillans_controller.rb

  def index
    @brands_list = Brand.all
    @companies_list = Company.all
---
SELECT "brands".* FROM "brands" ORDER BY name asc
SELECT "companies".* FROM "companies"