app/controllers/heroesnvillans_controller.rb

  def index
    if params[:cat].present?
    filter_category = Category.find_by(:category_name => params[:cat])
    @brands_list = Brand.all.where(:category_id => filter_category.id)
    @brands_list = @brands_list.order('brand_name asc')
---
SELECT "categories".* FROM "categories" WHERE "categories"."category_name" = 'Apparel' LIMIT 1
SELECT "brands".* FROM "brands" WHERE "brands"."category_id" = 143 ORDER BY brand_name asc
SELECT "brands".* FROM "brands" ORDER BY brand_name asc

  def show
    @brand = Brand.find_by(:id => params[:brand_id])
    @reviews = Review.where(:brand_id => params[:brand_id])
    @reviews_hero = Review.where(:brand_id => params[:brand_id]).where(:hero_vote => 1)
    @reviews_villan = Review.where(:brand_id => params[:brand_id]).where(:villan_vote => 1)
---
SELECT "brands".* FROM "brands" WHERE "brands"."id" IS NULL LIMIT 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."brand_id" = 105
SELECT "reviews".* FROM "reviews" WHERE "reviews"."brand_id" = 304 AND "reviews"."hero_vote" = 1
SELECT SUM("reviews"."hero_vote") AS sum_id FROM "reviews" WHERE "reviews"."brand_id" = 31
SELECT "reviews".* FROM "reviews" WHERE "reviews"."brand_id" = 305 AND "reviews"."villan_vote" = 1
SELECT SUM("reviews"."villan_vote") AS sum_id FROM "reviews" WHERE "reviews"."brand_id" = 31

 def create
    review = Review.new
    review.brand_id = params["brand_id"]
    review.user_id = params[:user_id]
    review.comment = params["comment"]
    if params["vote"] == "1"
      review.hero_vote = 1
    else
      review.villan_vote = 1
    end
    review.save
---
INSERT INTO "reviews" ("brand_id", "comment", "created_at", "updated_at", "villan_vote") VALUES (?, ?, ?, ?, ?)  [["brand_id", 299], ["comment", "Jimmy Dean eats babies."], ["created_at", Fri, 14 Mar 2014 02:13:20 UTC +00:00], ["updated_at", Fri, 14 Mar 2014 02:13:20 UTC +00:00], ["villan_vote", 1]]