app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'ben@dg.dc' LIMIT 1
---
  def create
    user = User.find_by(:email => params[:email])