app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 87 LIMIT 1
---
  def show
    @user = User.find_by(:id => params[:user_id])

INSERT INTO "users" ("created_at", "email", "password", "updated_at", "user_first", "user_last") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    user = User.new
    user.user_first = params[:user_first]
    user.user_last = params[:user_last]
    user.email = params[:email]
    user.password = params[:password]
    user.save